app/Controllers/Category.php

    public function __construct()
    {
        $this->modal = new CategoryModel();


        $data['categorys'] = $this->modal->orderBy('id', 'DESC')->paginate(10);
---
SELECT *
FROM `category`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `category`