app/Controllers/Dashboard.php

    public function __construct()
    {
        $this->modalService = new ServiceModel();
        $this->modalCategory = new CategoryModel();
        $data['services'] = $this->modalService->orderBy('id', 'DESC')->paginate(10);
        $data['categorys'] = $this->modalCategory->orderBy('id', 'DESC')->paginate(10);

        $this->modalMeta = new MetaModel();
        $data['meta'] = $this->modalMeta->find(1);
        $this->modalLogo = new LogoModel();
        $data['logo'] = $this->modalLogo->find(1);
---
SELECT *
FROM `service`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `service`
SELECT *
FROM `category`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `category`
SELECT *
FROM `logo`
WHERE `logo`.`id` = 1

    function update()
    {
        helper(['form', 'url']);

        $rules = [
            'title'          => 'required'
        ];



        $id = $this->request->getVar('id');

        if ($this->validate($rules)) {

            $data = [
                'title'     => $this->request->getVar('title'),
                'link'    => $this->request->getVar('link'),
                'category'    => $this->request->getVar('category'),
                'monitoring'    => $this->request->getVar('monitoring'),
                'ip'    => $this->request->getVar('ip'),
                'state'    => $this->request->getVar('state'),
                'updated'    => $this->request->getVar('updated'),
                'description'    => $this->request->getVar('description'),




            ];

            $this->modalService->update($id, $data);
---
UPDATE `service` SET `title` = 'test', `link` = 'test', `category` = 'Site internet', `monitoring` = '0', `ip` = '', `state` = 'En ligne'
WHERE `service`.`id` IN ('1')