app/Controllers/Index.php

SELECT *
FROM `logo`
WHERE `logo`.`id` = 1
SELECT *
FROM `category`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `category`
SELECT *
FROM `service`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `service`
SELECT *
FROM `message`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `message`
---
    public function __construct()
    {
        $this->modalMeta = new MetaModel();
        $data['meta'] = $this->modalMeta->find(1);

        $this->modalLogo = new LogoModel();
        $data['logo'] = $this->modalLogo->find(1);
        $this->modalService = new ServiceModel();
        $this->modalCategory = new CategoryModel();
        $this->modalMessage = new MessageModel();

        $data['categorys'] = $this->modalCategory->orderBy('id', 'desc')->paginate(10);

        $data['services'] = $this->modalService->orderBy('id', 'desc')->paginate(10);

        $data['messages'] = $this->modalMessage->orderBy('id', 'DESC')->paginate(10);