app/Controllers/Settings.php

    public function __construct()
    {
        helper(['form']);
        $this->modal = new MetaModel();
        $session = \Config\Services::session();


        $this->modalMeta = new MetaModel();
        $data['meta'] = $this->modalMeta->find(1);
        $this->modalLogo = new LogoModel();
        $data['logo'] = $this->modalLogo->find(1);
---
SELECT *
FROM `logo`
WHERE `logo`.`id` = 1