app/Controllers/Users.php

    public function __construct()
    {
        helper(['form']);
        $this->modal = new LoginModel();



        $data['logins'] = $this->modal->orderBy('id', 'DESC')->paginate(10);
---
SELECT *
FROM `login`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `login`