app/Controllers/User.php

SELECT *
FROM `login`
WHERE `login`.`id` = '2'
---
    public function __construct()
    {
        helper(['form']);
        $this->modal = new LoginModel();
        $session = \Config\Services::session();
        $id = $session->get('id');

        $data['logins'] = $this->modal->find($id);